app/controllers/recipes_controller.rb

SELECT * FROM `recipes` WHERE (`recipes`.`id` = 60086384)
---
  def show
    @recipe = Recipe.find(params[:id])